notes.org
#+hugo_base_dir: .
#+options: author:Aimee

** Rust and Computer Science                               :rust:cs:@hacking:
:PROPERTIES:
:EXPORT_FILE_NAME: rust-cs
:EXPORT_DATE: 2020-11-21
:EXPORT_HUGO_SECTION: hacking
:EXPORT_DESCRIPTION: Rust and CS resources.
:EXPORT_OPTIONS: toc:2
:END:

*** CS

[[https://reberhardt.com/cs110l/spring-2020/][CS 110L: Safety in Systems Programming]]
- [[https://reberhardt.com/cs110l/spring-2020/slides/lecture-18.pdf][Comparison between C and Rust]]

[[https://github.com/cis198-2016s][CIS 198 - Rust - Spring 2016]]
- [[https://cis198-2016s.github.io/projects/][Project page]]

[[https://github.com/SmallPond/MIT6.828_OS][MIT6.828 Operating System Engineering]]

Type system
- [[https://v5.chriskrycho.com/journal/things-i-was-wrong-about/1-types/][Things I Was Wrong About: Types]]

[[https://www.cs.utexas.edu/~EWD/transcriptions/EWD03xx/EWD340.html][The Humble Programmer by Edsger W. Dijkstra]]


[[https://mitpress.mit.edu/sites/default/files/sicp/full-text/book/book-Z-H-10.html][1.1  The Elements of Programming]]
> **Primitive expressions**, which represent the simplest entities the language is concerned with,
>
> **Means of combination**, by which compound elements are built from simpler ones, and
>
> **means of abstraction**, by which compound elements can be named and manipulated as units

*** Rust language

[[https://people.mpi-sws.org/~jung/phd/thesis-screen.pdf][Understanding and Evolving the Rust Programming Language]] August 2020

[[https://wiki.alopex.li/RustStarterKit2020][Rust Starter Kit 2020]]

Video: [[https://www.youtube.com/watch?v=0zOg8_B71gE][Pascal Hertleif - Writing Idiomatic Libraries in Rust]]

*** Rust discussion

[[https://readrust.net/computer-science][ReadRust: Computer Science]]

[[https://www.reddit.com/r/rust/comments/6nw22d/opinions_about_using_rust_instead_of_c_in/][Reddit discussion: Opinions about using Rust instead of C in Computer Science courses]]

Rust weaknesses:
[[https://www.reddit.com/r/rust/comments/jia2xn/what_are_some_of_rusts_weaknesses_as_a_language/][This question got a bunch of discussions]]


